blog.org
#+Title: Cosmoi
#+Author: Mario Román
#+Email: mromang08@gmail.com
#+Creator: <a href="https://mroman42.github.com">@mroman42</a>.

#+Options: toc:nil date:t num:nil
#+Options: html-style:nil
#+Options: html-postamble:t

** Mikrokosmos                                                                               :post:
:PROPERTIES:
:TITLE: Mikrokosmos
:EXPORT_FILE_NAME: mikrokosmos.html
:EXPORT_DATE: <2018-05-25 Fri 18:01>
:END:

#+BEGIN_EXPORT HTML
<script src="https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.29.0/codemirror.min.js"></script>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.29.0/codemirror.css">
<script src="https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.29.0/addon/mode/simple.min.js"></script>
<script src="https://mroman42.github.io/mikrokosmos-js/codemirrormkr.js"></script>
<script language="javascript" src="https://mroman42.github.io/mikrokosmos-js/rts.js"></script>
<script language="javascript" src="https://mroman42.github.io/mikrokosmos-js/lib.js"></script>
<script language="javascript" src="https://mroman42.github.io/mikrokosmos-js/out.js"></script>
<script language="javascript" src="https://mroman42.github.io/mikrokosmos-js/runmain.js"></script>
<script language="javascript" src="https://mroman42.github.io/mikrokosmos-js/mikrobox.js" defer></script>

<style>
.CodeMirror {
  border: 1px solid #eee;
  height: auto;
  overflow-y: hidden;
}
.CodeMirror-scroll {
  height: auto;
  overflow-y: hidden;
  overflow-x: auto;
}
.mikrojs-console {
  height: auto;
}
pre {
    box-shadow: 0px 0px 1px #eee;
}
</style>
#+END_EXPORT

*Mikrokosmos* is an untyped and simply typed λ-calculus interpreter,
borrowing its name from the series of progressive piano études
Mikrokosmos written by Bela Bartok. It aims to provide students with a
tool to learn and understand the λ-calculus.

 * [[https://github.com/mroman42/mikrokosmos][GitHub repository]].
 * [[https://mroman42.github.io/mikrokosmos/][User's guide]].
 * [[https://github.com/mroman42/jupyter-mikrokosmos][Jupyter kernel]].

Since version 0.3.0, it comes bundled with a Jupyter Notebook kernel,
a tutorial on lambda calculus and specific modes for SKI combinators.
Thanks to [[https://github.com/ghcjs/ghcjs][GHCJS]] and [[http://codemirror.net/][Codemirror]], you can also try the [[https://github.com/mroman42/mikrokosmos][Mikrokosmos]]
lambda interpreter in your browser. Press the *evaluate* button below
and play with the code!

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Lambda expressions are written with \ or λ, as in
(λx.x)
(\x.\y.x)(\x.x)

# Libraries available
plus 2 3
sum (cons 1 (cons 2 (cons 3 nil)))

# Untyped, but also simply-typed λ-calculus
:types on
swap = \m.(snd m, fst m)
swap

# Gentzen-style deduction trees
@@ \z.(snd z,fst z)</script>
</div>
#+END_EXPORT

