mikrokosmos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-01 Sun 22:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mikrokosmos</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a href="index.html">Cosmoi</a>
</div>
<div id="navigation">
<a href="index.html">Index</a>
<a href="about.html">About</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">Mikrokosmos</h1>
<script src="https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.29.0/codemirror.min.js"></script>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.29.0/codemirror.css">
<script src="https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.29.0/addon/mode/simple.min.js"></script>
<script src="https://mroman42.github.io/mikrokosmos-js/codemirrormkr.js"></script>
<script language="javascript" src="https://mroman42.github.io/mikrokosmos-js/rts.js"></script>
<script language="javascript" src="https://mroman42.github.io/mikrokosmos-js/lib.js"></script>
<script language="javascript" src="https://mroman42.github.io/mikrokosmos-js/out.js"></script>
<script language="javascript" src="https://mroman42.github.io/mikrokosmos-js/runmain.js"></script>
<script language="javascript" src="https://mroman42.github.io/mikrokosmos-js/mikrobox.js" defer></script>

<style>
.CodeMirror {
  border: 1px solid #eee;
  height: auto;
  overflow-y: hidden;
}
.CodeMirror-scroll {
  height: auto;
  overflow-y: hidden;
  overflow-x: auto;
}
.mikrojs-console {
  height: auto;
}
pre {
    box-shadow: 0px 0px 1px #eee;
}
</style>

<p>
<b>Mikrokosmos</b> is an untyped and simply typed λ-calculus interpreter,
borrowing its name from the series of progressive piano études
Mikrokosmos written by Bela Bartok. It aims to provide students with a
tool to learn and understand the λ-calculus.
</p>

<ul class="org-ul">
<li><a href="https://github.com/mroman42/mikrokosmos">GitHub repository</a>.</li>
<li><a href="https://mroman42.github.io/mikrokosmos/">User's guide</a>.</li>
<li><a href="https://github.com/mroman42/jupyter-mikrokosmos">Jupyter kernel</a>.</li>
</ul>

<p>
Since version 0.3.0, it comes bundled with a Jupyter Notebook kernel,
a tutorial on lambda calculus and specific modes for SKI combinators.
Thanks to <a href="https://github.com/ghcjs/ghcjs">GHCJS</a> and <a href="http://codemirror.net/">Codemirror</a>, you can also try the <a href="https://github.com/mroman42/mikrokosmos">Mikrokosmos</a>
lambda interpreter in your browser. Press the <b>evaluate</b> button below
and play with the code!
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Lambda expressions are written with \ or λ, as in
(λx.x)
(\x.\y.x)(\x.x)

# Libraries available
plus 2 3
sum (cons 1 (cons 2 (cons 3 nil)))

# Untyped, but also simply-typed λ-calculus
:types on
swap = \m.(snd m, fst m)
swap

# Gentzen-style deduction trees
@@ \z.(snd z,fst z)</script>
</div>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited 2018-05-25 Fri 18:01. Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
